src/toir_cfe/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="5761f0bd-211f-4da4-82fc-476910d2db04">
    <name>проф_НормативныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="757bfdf7-b0f2-4ce9-bf65-9a73743034b9">
    <name>проф_ПредшествующиеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="27d1aabe-5590-4b8a-92b6-17540e81adc7">
    <name>проф_ЗамещаемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ee9e378e-a344-4a59-a2a5-054789005c8d">
    <name>проф_ТабличноеПолеРемонтныеЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f450d93a-cf39-4570-a8cc-896795681912">
    <name>проф_РемЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e01b6f5d-fe35-434f-87a5-1ce36557d3e2">
    <name>проф_ТабЗапчастейОбъектовРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0bdcaf87-2304-461b-9957-e534bec7fb10">
    <name>проф_ТабЗатратПоВидамРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c30740dc-2210-44f4-be97-a6f7b8e216b1">
    <name>проф_ГарантииОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

src/toir_cfe/src/InformationRegisters/торо_ОбщиеДанныеПоРемонтам/торо_ОбщиеДанныеПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1b8fbeca-59ee-4207-b4da-c1fdb926cf07">
  <name>торо_ОбщиеДанныеПоРемонтам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ca7de41a-4380-42d3-b93b-3d14a13ce3d9">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a534769e-5beb-4b57-b3af-d138e38afe8e">
    <name>ЕстьЗаявка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e320ae57-9da9-47dd-9d22-4265d1574beb">
    <name>ЕстьНаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="26632482-bdd2-4881-af87-d856096d8d30">
    <name>ЕстьАкт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d55a38b3-ccd6-42d5-ae8f-6fe7a5e3b7e3">
    <name>ЕстьАктПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f7d027da-099e-47c1-b6c6-76397094ed0e">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="646d6d26-3edf-4e80-88ae-f94e1a83e51d">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="760d81bf-833c-42a4-8d1e-f2df012d64e5">
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="ba85eb5c-9b6e-4b48-91c7-27de33dd2f16">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="088d9db2-1a15-4bff-99d4-26bc08da07cd">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8d7e3dc7-96eb-4e67-9634-d1e75420b4bb">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="60e67476-1608-4996-b48f-ffa74f993732">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="332898fd-fb46-4e34-af0e-1450d855fac1">
    <name>ПодразделениеИнициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="442326ff-0b99-4a6d-81af-fa819b4a7b89">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="09bf821b-96d8-44ff-a873-1aa963572a34">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="72058171-1407-4dd6-aab0-0f72afd60d2a">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="168c85e9-3bb0-431a-ae6e-08c455b37fa5">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="9f5d4e4f-bee5-4929-ac3d-e4200cf1416f">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a6306ae3-4e8a-4225-8afa-a01e16f34954">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="85c92d14-1c04-44bd-9284-befe63c7394c">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="605b0bf5-59d2-473b-b6f9-85ceca4cd110">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf35ff03-c641-42bf-90fc-6469235dafc0">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8b164589-2f76-44c2-86db-13b16b9df744">
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2cd062c3-ed73-4f60-acc5-8ad2b64fc56a">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="91a3657a-5af9-486c-bdd1-67ccd3de7fce">
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="f70fd13e-81a3-43b3-9a2a-08cc80f978c7">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5e090819-3bf8-4a64-a7d2-0ab585ce4316">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_АктПриемкиОборудования/торо_АктПриемкиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="215195ca-32a7-4eab-8de8-102384590758">
  <name>торо_АктПриемкиОборудования</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6683b3cf-0e7c-4b93-b7e3-dcc99b274655">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8513385e-6034-419a-b807-16cbaf009992">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_НарядНаРегламентноеМероприятие/торо_НарядНаРегламентноеМероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="569de3d5-6e64-4b40-92cf-e29c27b7264e">
  <name>торо_НарядНаРегламентноеМероприятие</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="c51c5296-cd89-48da-9960-5287203a1001">
    <name>РегламентныеМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d3fc8eef-33e3-4d9e-a6f5-15ebad05dbe4">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/торо_ОбъектыРемонта/ManagerModule.bsl
&Вместо("ПечатьПаспортаОР")
Функция проф_ПечатьПаспортаОР(МассивОбъектов, ПараметрыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.торо_ОбъектыРемонта.проф_ПФ_MXL_ПаспортОР");
	
	Если ПараметрыПечати.Свойство("ПечатаемыеРазделы") Тогда
		ПечатаемыеРазделы = ПараметрыПечати.ПечатаемыеРазделы;
	Иначе
		ПечатаемыеРазделы = ДоступныеПечатныеРазделыПаспортаОР();
	КонецЕсли;
    Если ПараметрыПечати.Свойство("ТекСтруктураИерархии") Тогда
		ТекСтруктураИерархии = ПараметрыПечати.ТекСтруктураИерархии;
	Иначе
		ТекСтруктураИерархии = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	
	ЗаголовокИОсновныеДанные = ПолучитьВыборкуДляПечатиПаспортаОР(МассивОбъектов, ТекСтруктураИерархии);
	
	ЭтоПервый = Истина;
	ИспользоватьФМ = ПолучитьФункциональнуюОпцию("торо_ИспользоватьФункциональныеМеста");
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения");
	ИспользоватьРегламентныеМероприятия = ПолучитьФункциональнуюОпцию("торо_ИспользоватьРегламентныеМероприятия");
	ИспользоватьКоэффициентыРемОсобенностей = ПолучитьФункциональнуюОпцию("торо_ИспользоватьКоэффициентыРемОсобенностей");
	
	Пока ЗаголовокИОсновныеДанные.Следующий() Цикл
		
		Если НЕ ЭтоПервый Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		ЭтоЕдиницаОборудования = Истина;
		Если ИспользоватьФМ И ЗаголовокИОсновныеДанные.ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда
			ЭтоЕдиницаОборудования = Ложь;
		КонецЕсли;
		
		ТабДок.Вывести(Макет.ПолучитьОбласть("НаименованиеПФ"));
				
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("Заголовок"),  ТабДок, ЗаголовокИОсновныеДанные);
		
		// Флаг основные
		Если ПечатаемыеРазделы.Свойство("ФлагОсновные") И ПечатаемыеРазделы.ФлагОсновные = Истина Тогда
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлОсновные"), ТабДок);
			ДатаСнятия = ПолучитьДатуСнятияСУчета(МассивОбъектов);
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ОбщиеБлок1"), Табдок, ЗаголовокИОсновныеДанные, ДатаСнятия);
			
			Если Константы.торо_ИспользоватьДокументыПринятияИСписанияОборудования.Получить() Тогда 
				ТабДок.Область("СнятиеСУчета").Видимость = Истина;
			Иначе
				ТабДок.Область("СнятиеСУчета").Видимость = Ложь;
			КонецЕсли;
			
			ТабДок.Область("ОблИнвентарныйНомер").Видимость = ЭтоЕдиницаОборудования;
			ТабДок.Область("ОблСрокПолезногоИспользования").Видимость = ЭтоЕдиницаОборудования;
			
			Если ЗаголовокИОсновныеДанные.ВнешнийОбъект И ЭтоЕдиницаОборудования Тогда
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ОбщиеБлок3"), Табдок, ЗаголовокИОсновныеДанные);
			Иначе
				Область = Макет.ПолучитьОбласть("ОбщиеБлок2");
				Область.Параметры.Организация = торо_ЗаполнениеДокументов.ПолучитьПредставлениеОрганизацииДляПечати(ЗаголовокИОсновныеДанные.Организация);
				Область.Параметры.Подразделение = ЗаголовокИОсновныеДанные.Подразделение;
				ТабДок.Вывести(Область);
			КонецЕсли; 
			
			Если ЭтоЕдиницаОборудования Тогда
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ОбщиеБлок4"), Табдок, ЗаголовокИОсновныеДанные);
			КонецЕсли;
			
			КонтактнаяИнформацияАдрес = ПолучитьАдрес(ЗаголовокИОсновныеДанные.Ссылка);
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ОбластьМестоположение"), Табдок, ЗаголовокИОсновныеДанные);
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ОбластьАдрес"), Табдок, КонтактнаяИнформацияАдрес);
		
		КонецЕсли;
		
		Результат = Неопределено;
		
		// Характеристики
		Если ПечатаемыеРазделы.Свойство("ФлагХарактеристики") И ПечатаемыеРазделы.ФлагХарактеристики = Истина И ИспользоватьДополнительныеРеквизитыИСведения
			И ЭтоЕдиницаОборудования Тогда
			
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлСвойства"), ТабДок);
			
			Результат = УправлениеСвойствами.ЗначенияСвойств(ЗаголовокИОсновныеДанные.Ссылка);	
			
			// заполнить недублирующиеся свойства из типового ор
			Если ЗначениеЗаполнено(ЗаголовокИОсновныеДанные.ТиповойОР) Тогда
				СписокЗаполненныхСвойств = Новый массив;
				Для Каждого СтрокаДопРеквизита из ЗаголовокИОсновныеДанные.Ссылка.ДополнительныеРеквизиты Цикл
					Если ЗначениеЗаполнено(СтрокаДопРеквизита.Значение) Тогда
						СписокЗаполненныхСвойств.Добавить(СтрокаДопРеквизита.Свойство);
					КонецЕсли;
				КонецЦикла;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 	"ВЫБРАТЬ
				|	торо_ТиповыеОРДополнительныеРеквизиты.Ссылка КАК Источник,
				|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство,
				|	торо_ТиповыеОРДополнительныеРеквизиты.Значение
				|ИЗ
				|	Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
				|ГДЕ
				|	торо_ТиповыеОРДополнительныеРеквизиты.Ссылка = &ТиповойОР
				|	И НЕ торо_ТиповыеОРДополнительныеРеквизиты.Свойство В (&Свойства)";
				
				Запрос.УстановитьПараметр("ТиповойОР", ЗаголовокИОсновныеДанные.ТиповойОР);
				Запрос.УстановитьПараметр("Свойства", СписокЗаполненныхСвойств);
				
				ВыборкаСвойств = Запрос.Выполнить().Выбрать();
				Пока ВыборкаСвойств.Следующий() Цикл
					Если НЕ ЗначениеЗаполнено(ВыборкаСвойств.Значение) Тогда
						Продолжить;
					Конецесли;
					
					НовСтр = Результат.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаСвойств);
				КонецЦикла;
			КонецЕсли;
			
			Если Результат.Количество() <> 0 Тогда
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокСвойства"),ТабДок);
				Область = Макет.ПолучитьОбласть("ТаблСвойства");
				
				Для Каждого Характеристика Из Результат Цикл
					ЗаполнитьИВывестиОбласть(Область, ТабДок, Характеристика);
				КонецЦикла;
			КонецЕсли; 
			
		КонецЕсли;
		
		//++ Проф-ИТ, #88, Соловьев А.А., 29.12.2023
		Если ПечатаемыеРазделы.Свойство("ФлагХарактеристики") И ПечатаемыеРазделы.ФлагХарактеристики = Истина Тогда 
			СписокСвойств = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаголовокИОсновныеДанные.Ссылка, "проф_ГрузоподъемностьВТоннах,
				|проф_ВместимостьВКубическихМетрах, проф_СобственныйВес, проф_ГабаритныйРазмерВысота, проф_ГабаритныйРазмерДлина, проф_ГабаритныйРазмерШирина");
			
			Область = Макет.ПолучитьОбласть("ГрузоподъемностьГабартныеРазмеры");
			Область.Параметры.проф_ГрузоподъемностьВТоннах = СписокСвойств.проф_ГрузоподъемностьВТоннах;
			Область.Параметры.проф_ВместимостьВКубическихМетрах = СписокСвойств.проф_ВместимостьВКубическихМетрах;
			Область.Параметры.проф_СобственныйВес = СписокСвойств.проф_СобственныйВес;
			Область.Параметры.проф_ГабаритныйРазмерВысота = СписокСвойств.проф_ГабаритныйРазмерВысота;
			Область.Параметры.проф_ГабаритныйРазмерДлина = СписокСвойств.проф_ГабаритныйРазмерДлина;
			Область.Параметры.проф_ГабаритныйРазмерШирина = СписокСвойств.проф_ГабаритныйРазмерШирина;
			ТабДок.Вывести(Область);
		КонецЕсли;
		//-- Проф-ИТ, #88, Соловьев А.А., 29.12.2023
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Показатели 
		Если ПечатаемыеРазделы.Свойство("ФлагКонтролируемыеПоказатели") И ПечатаемыеРазделы.ФлагКонтролируемыеПоказатели = Истина
			И ПолучитьФункциональнуюОпцию("торо_УчетКонтролируемыхПоказателей") Тогда
			ПечатьПаспортаОР_КонтролируемыеПоказатели(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Наработка
		Если ПечатаемыеРазделы.Свойство("ФлагНаработка") И ПечатаемыеРазделы.ФлагНаработка = Истина
			И ПолучитьФункциональнуюОпцию("торо_УчетНаработкиОборудования") Тогда	
			ПечатьПаспортаОР_Наработка(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Ремонты
		Если ПечатаемыеРазделы.Свойство("ФлагРемонты") И ПечатаемыеРазделы.ФлагРемонты = Истина Тогда
			ПечатьПаспортаОР_Ремонты(ТабДок, Макет, ЗаголовокИОсновныеДанные, НЕ ЭтоЕдиницаОборудования);
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Нормативные ремонты
		Если ПечатаемыеРазделы.Свойство("ФлагНормативныеРемонты") И ПечатаемыеРазделы.ФлагНормативныеРемонты = Истина  Тогда
			ПечатьПаспортаОР_НормативныеРемонты(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;

		///////////////////////////////////////////////////////////////////////////
		// Флаг Запчасти ремонты
		Если ПечатаемыеРазделы.Свойство("ФлагЗапчасти") И ПечатаемыеРазделы.ФлагЗапчасти = Истина
			И ПолучитьФункциональнуюОпцию("торо_УчетЗапчастей") Тогда
			ПечатьПаспортаОР_Запчасти(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Состав техкарт
		Если ПечатаемыеРазделы.Свойство("ФлагТехкарты") И ПечатаемыеРазделы.ФлагТехкарты = Истина  Тогда
			ПечатьПаспортаОР_СоставТехКарт(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;
		
		//////////////////////////////////////////////////////////////////////////////
		// Флаг Регламентные мероприятия
		Если ИспользоватьРегламентныеМероприятия Тогда
			Если ПечатаемыеРазделы.Свойство("ФлагРегМероприятия") И ПечатаемыеРазделы.ФлагРегМероприятия = Истина Тогда 
				ПечатьПаспортаОР_Мероприятия(ТабДок, Макет, ЗаголовокИОсновныеДанные);
			КонецЕсли;
		КонецЕсли;
				
		///////////////////////////////////////////////////////////////////////////
		// Флаг ФлагКоэффициентыРемонтныхОсобенностей
		Если ИспользоватьКоэффициентыРемОсобенностей И ПечатаемыеРазделы.Свойство("ФлагКоэффициентыРемонтныхОсобенностей")
			И ПечатаемыеРазделы.ФлагКоэффициентыРемонтныхОсобенностей = Истина И ЭтоЕдиницаОборудования Тогда
			ПечатьПаспортаОР_КоэффициентыРемонтныхОсобенностей(ТабДок, Макет, ЗаголовокИОсновныеДанные);
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг Дополнительно
		Если ПечатаемыеРазделы.Свойство("ФлагДополнительно") И ПечатаемыеРазделы.ФлагДополнительно = Истина  Тогда
			
			Дополнительно = Макет.ПолучитьОбласть("Дополнительно");	
			Дополнительно.Параметры.Приоритет                  = ЗаголовокИОсновныеДанные.Приоритет;
			Дополнительно.Параметры.РемонтноеПодразделение     = ЗаголовокИОсновныеДанные.ПодразделениеИсполнитель;
			Дополнительно.Параметры.КонтрагентИсполнительРемонта = ЗаголовокИОсновныеДанные.КонтрагентИсполнительРемонта;
			Дополнительно.Параметры.НеУчаствуетВПланировании   = ЗаголовокИОсновныеДанные.НеУчаствуетВПланировании;
			Дополнительно.Параметры.ВестиУчетСерийныхЗапчастей = ЗаголовокИОсновныеДанные.ВестиУчетСерийныхЗапчастей;
			Если ЗначениеЗаполнено(ЗаголовокИОсновныеДанные.ШтрихКод) Тогда 
				Обработки.торо_ГенерацияШтрихКодов.ОтрисоватьШтрихКод(ЗаголовокИОсновныеДанные.ШтрихКод, 
					ЗаголовокИОсновныеДанные.ТипШтрихКода, Дополнительно);
			Иначе
				Дополнительно.Рисунки.ШтрихКод.Картинка = Новый Картинка;
			КонецЕсли;

			ТабДок.Вывести(Дополнительно);
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////////////
		// Флаг ПрикрепленныеФайлы
		Если ПечатаемыеРазделы.Свойство("ФлагПрикрепленныеФайлы") И ПечатаемыеРазделы.ФлагПрикрепленныеФайлы = Истина Тогда
			
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлФайлы"), ТабДок);
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
			Запрос.Текст = "ВЫБРАТЬ
			|	торо_ОбъектыРемонтаПрисоединенныеФайлы.Наименование,
			|	торо_ОбъектыРемонтаПрисоединенныеФайлы.Описание
			|ИЗ
			|	Справочник.торо_ОбъектыРемонтаПрисоединенныеФайлы КАК торо_ОбъектыРемонтаПрисоединенныеФайлы
			|ГДЕ
			|	торо_ОбъектыРемонтаПрисоединенныеФайлы.ВладелецФайла = &ОбъектРемонта";
			
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаголовокФайлы"),ТабДок);
				Файл = Результат.Выбрать();
				Область = Макет.ПолучитьОбласть("ТаблФайлы");
				
				Пока Файл.Следующий() Цикл
					ЗаполнитьИВывестиОбласть(Область, ТабДок, Файл);
				КонецЦикла;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.КлючПараметровПечати = "торо_ПечатьОР_ПаспортОР";
	
	Возврат ТабДок;
	
КонецФункции

&ИзменениеИКонтроль("ПечатьПаспортаОР_Ремонты")
Процедура проф_ПечатьПаспортаОР_Ремонты(ТабДок, Макет, ЗаголовокИОсновныеДанные, ЭтоФункциональноеМесто)

	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлРемонты"), Табдок);

	МассивОбъектов = Новый Массив;
	Если ЭтоФункциональноеМесто Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_СоставФункциональныхМест.ОбъектРемонта КАК УстановленныйОР
		|ИЗ
		|	РегистрСведений.торо_СоставФункциональныхМест КАК торо_СоставФункциональныхМест
		|ГДЕ
		|	торо_СоставФункциональныхМест.ФункциональноеМесто = &ОбъектРемонта";

		Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		Пока Выборка.Следующий() Цикл
			МассивОбъектов.Добавить(Выборка.УстановленныйОР);
		КонецЦикла;

	Иначе
		МассивОбъектов.Добавить(ЗаголовокИОсновныеДанные.Ссылка);
	КонецЕсли;

	//////////////////////////////////////////////////////////////////////////	
	// Область "Внешние основания"
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьВнешниеОснованияДляРабот") Тогда 
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ВнешниеОснования"), Табдок);

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ВнешниеОснованияДляРаботСрезПоследних.Регистратор КАК Регистратор,
		|	торо_ВнешниеОснованияДляРаботСрезПоследних.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
		|	торо_ВнешниеОснованияДляРаботСрезПоследних.Описание КАК Описание
		|ПОМЕСТИТЬ ВТ_ВнешниеОснования
		|ИЗ
		|	РегистрСведений.торо_ВнешниеОснованияДляРабот.СрезПоследних(, ОбъектРемонта В (&МассивОР)) КАК торо_ВнешниеОснованияДляРаботСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ВнешнееОснованиеДляРабот.Номер КАК Номер,
		|	ВТ_ВнешниеОснования.ПлановаяДатаРемонта КАК ПлановаяДатаРемонта,
		|	ВТ_ВнешниеОснования.Описание КАК Описание
		|ИЗ
		|	ВТ_ВнешниеОснования КАК ВТ_ВнешниеОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
		|		ПО ВТ_ВнешниеОснования.Регистратор = торо_ВнешнееОснованиеДляРабот.Ссылка
		|ГДЕ
		|	торо_ВнешнееОснованиеДляРабот.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПлановаяДатаРемонта";

		Запрос.УстановитьПараметр("МассивОР", МассивОбъектов);
		Результат = Запрос.Выполнить();

		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпВнешниеОснования"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблВнешниеОснования");

			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	//////////////////////////////////////////////////////////////////////////	
	// Область "Выявленные дефекты"
	Если ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования") Тогда 
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ВыявленныеДефекты"), Табдок);

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Ссылка,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Номер КАК Номер,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Дата КАК Дата,
		|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
		|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
		|	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина КАК ПричинаДефекта,
		|	торо_ВыявленныеДефектыСписокДефектов.КритичностьДефекта КАК КритичностьДефекта,
		|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ОписаниеДефекта,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения КАК ДатаОбнаружения
		|ИЗ
		|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		|ГДЕ
		|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта В(&МассивОР)
		|	И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Дата";

		Запрос.УстановитьПараметр("МассивОР", МассивОбъектов);
		Результат = Запрос.Выполнить();

		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпВыявленныеДефекты"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблВыявленныеДефекты");

			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	//////////////////////////////////////////////////////////////////////////
	// Область "ПредстоящиеРемонты"
	#Удаление
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ПредстоящиеРемонты"),ТабДок);	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ПлановыеРемонтныеРаботы
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, ОбъектРемонтныхРабот В (&МассивОР)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен
	|	И НЕ торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот КАК НачалоРемонта,
	|	ВТ_ПлановыеРемонтныеРаботы.ДатаОкончанияРемонтныхРабот КАК ОкончаниеРемонта,
	|	ВТ_ПлановыеРемонтныеРаботы.Регистратор КАК Регистратор,
	|	ВТ_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВТ_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВТ_ПлановыеРемонтныеРаботы.ID КАК ID
	|ИЗ
	|	ВТ_ПлановыеРемонтныеРаботы КАК ВТ_ПлановыеРемонтныеРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ПО ВТ_ПлановыеРемонтныеРаботы.ID = торо_ОбщиеДанныеПоРемонтам.IDРемонта
	|ГДЕ
	|	НЕ торо_ОбщиеДанныеПоРемонтам.Завершен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидРемонтныхРабот,
	|	НачалоРемонта";

	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата());
	Запрос.УстановитьПараметр("МассивОР", МассивОбъектов);

	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпПредстоящиеРемонты"),ТабДок);	
		Выборка = Результат.Выбрать();
		ТаблВыполненныеРемонты = Макет.ПолучитьОбласть("ТблПредстоящиеРемонты");

		Пока Выборка.Следующий() Цикл
			ТаблВыполненныеРемонты.Параметры.Заполнить(Выборка);
			ТаблВыполненныеРемонты.Параметры.ВидРемонтныхРабот = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Выборка.ВидРемонтныхРабот);
			ТабДок.Вывести(ТаблВыполненныеРемонты, Выборка.Уровень()); 
		КонецЦикла;
	КонецЕсли;
	#КонецУдаления
	//////////////////////////////////////////////////////////////////////////	
	// Область "Заявки на ремонт"
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьСметыРемонта") Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ЗаявкиНаРемонт"), Табдок);

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК НачалоРемонта,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ОкончаниеРемонта,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Дата КАК ДатаДокумента,
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Номер КАК Номер
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
		|ГДЕ
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта В (&МассивОР)
		|	И торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала";

		Запрос.УстановитьПараметр("МассивОР", МассивОбъектов);

		Результат = Запрос.Выполнить();

		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпЗаявкиНаРемонт"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблЗаявкиНаРемонт");

			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	//////////////////////////////////////////////////////////////////////////	
	// Область "Наряды на выполнение ремонтных работ"
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядыНаВыполнениеРабот") Тогда 
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("НарядыНаРемРаботы"), Табдок);

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка КАК Ссылка,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата КАК Дата,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Номер КАК Номер,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаНачала КАК ДатаНачала,
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
		|ГДЕ
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ОбъектРемонта В (&МассивОР)
		|	И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка.Дата";

		Запрос.УстановитьПараметр("МассивОР", МассивОбъектов);
		Результат = Запрос.Выполнить();

		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпНарядыНаРемРаботы"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблНарядыНаРемРаботы");

			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	//////////////////////////////////////////////////////////////////////////
	// Область "ВыполненныеРемонты"
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ВыполненныеРемонты"),ТабДок);

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ЗавершенныеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыНачала.ДатаНачала, торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания) КАК ПланДатаНачалаРемонтныхРабот,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыНачала.ДатаОкончания, торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания) КАК ПланДатаЗавершенияРемонтныхРабот,
	|	ЕСТЬNULL(торо_СвернутыеФактическиеДатыРемонтов.ДатаНачала, торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания) КАК ФактДатаНачалаРемонтныхРабот,
	|	ЕСТЬNULL(торо_СвернутыеФактическиеДатыРемонтов.ДатаОкончания, торо_ЗавершенныеРемонтныеРаботы.ДатаОкончания) КАК ФактДатаЗавершенияРемонтныхРабот,
	|	торо_ЗавершенныеРемонтныеРаботы.Регистратор КАК Документ
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыНачала
	|		ПО торо_ЗавершенныеРемонтныеРаботы.ID = торо_АктуальныеПлановыеДатыНачала.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СвернутыеФактическиеДатыРемонтов КАК торо_СвернутыеФактическиеДатыРемонтов
	|		ПО торо_ЗавершенныеРемонтныеРаботы.ID = торо_СвернутыеФактическиеДатыРемонтов.IDРемонта
	|ГДЕ
	|	торо_ЗавершенныеРемонтныеРаботы.ОбъектРемонта В(&МассивОР)
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ЗавершенныеРемонтныеРаботы.ВидРемонтныхРабот,
	|	ПланДатаНачалаРемонтныхРабот";

	Запрос.УстановитьПараметр("МассивОР", МассивОбъектов);

	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпВыполненныеРемонты"),ТабДок);
		Выборка = Результат.Выбрать();
		ТаблВыполненныеРемонты = Макет.ПолучитьОбласть("ТблВыполненныеРемонты");

		Пока Выборка.Следующий() Цикл
			ТаблВыполненныеРемонты.Параметры.Заполнить(Выборка);
			ТаблВыполненныеРемонты.Параметры.ВидРемонтныхРабот = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Выборка.ВидРемонтныхРабот);
			ТабДок.Вывести(ТаблВыполненныеРемонты, Выборка.Уровень()); 
		КонецЦикла;
	КонецЕсли; 

	//////////////////////////////////////////////////////////////////////////	
	// Область "Акты о приемке оборудования"
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьАктПриемкиОборудования") Тогда 
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("АктыПриемкиОборудования"), Табдок);

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка КАК Ссылка,
		|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Номер КАК Номер,
		|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Дата КАК Дата,
		|	торо_АктПриемкиОборудованияРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
		|	торо_АктПриемкиОборудованияРемонтыОборудования.ДатаНачала КАК ДатаНачала,
		|	торо_АктПриемкиОборудованияРемонтыОборудования.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.торо_АктПриемкиОборудования.РемонтыОборудования КАК торо_АктПриемкиОборудованияРемонтыОборудования
		|ГДЕ
		|	торо_АктПриемкиОборудованияРемонтыОборудования.ОбъектРемонта В (&МассивОР)
		|	И торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_АктПриемкиОборудованияРемонтыОборудования.Ссылка.Дата";

		Запрос.УстановитьПараметр("МассивОР", МассивОбъектов);
		Результат = Запрос.Выполнить();

		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпАктыПриемкиОборудования"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблАктыПриемкиОборудования");

			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ПечатьПаспортаОР_Мероприятия")
Процедура проф_ПечатьПаспортаОР_Мероприятия(ТабДок, Макет, ЗаголовокИОсновныеДанные)
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ГлМероприятия"), Табдок);

	//////////////////////////////////////////////////////////////////////////	
	// Область "Предстоящие регламентные мероприятия"
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ПредстоящиеРМ"), ТабДок);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_МаршрутыРегламентныхМероприятий.СписокОбъектов КАК СписокОбъектов
	|ПОМЕСТИТЬ СписокОбъектовРМ
	|ИЗ
	|	РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|ГДЕ
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта = &ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаНачала КАК ДатаНачала,
	|	торо_ПлановыеМероприятияСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	|	торо_ПлановыеМероприятияСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеМероприятияСрезПоследних.ВидМероприятия КАК ВидМероприятия,
	|	торо_ПлановыеМероприятияСрезПоследних.СписокОбъектов КАК СписокОбъектов,
	|	торо_ПлановыеМероприятияСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ПлановыеМероприятия
	|ИЗ
	|	РегистрСведений.торо_ПлановыеМероприятия.СрезПоследних(
	|			,
	|			СписокОбъектов В
	|				(ВЫБРАТЬ
	|					СписокОбъектовРМ.СписокОбъектов КАК СписокОбъектов
	|				ИЗ
	|					СписокОбъектовРМ КАК СписокОбъектовРМ)) КАК торо_ПлановыеМероприятияСрезПоследних
	|ГДЕ
	|	НЕ торо_ПлановыеМероприятияСрезПоследних.Отменен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПлановыеМероприятия.ДатаНачала КАК ДатаНачала,
	|	ВТ_ПлановыеМероприятия.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ПлановыеМероприятия.Регистратор КАК Регистратор,
	|	ВТ_ПлановыеМероприятия.ВидМероприятия КАК ВидМероприятия,
	|	ВТ_ПлановыеМероприятия.СписокОбъектов КАК СписокОбъектов,
	|	ВТ_ПлановыеМероприятия.ID КАК ID
	|ИЗ
	|	ВТ_ПлановыеМероприятия КАК ВТ_ПлановыеМероприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ПО ВТ_ПлановыеМероприятия.ID = торо_ОбщиеДанныеПоРемонтам.IDРемонта
	|ГДЕ
	|	НЕ торо_ОбщиеДанныеПоРемонтам.Завершен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ПлановыеМероприятия.ВидМероприятия.Наименование,
	|	ДатаНачала";

	Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпПредстоящиеРМ"),ТабДок);	
		Выборка = Результат.Выбрать();
		Область = Макет.ПолучитьОбласть("ТблПредстоящиеРМ");

		Пока Выборка.Следующий() Цикл
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.ВидМероприятия = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Выборка.ВидМероприятия);
			ТабДок.Вывести(Область, Выборка.Уровень()); 
		КонецЦикла;
	КонецЕсли;

	#Вставка
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Регистратор КАК Регистратор,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.ID КАК ID
	|ПОМЕСТИТЬ ВТ_ПлановыеРемонтныеРаботы
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, ОбъектРемонтныхРабот В (&МассивОР)) КАК торо_ПлановыеРемонтныеРаботыСрезПоследних
	|ГДЕ
	|	торо_ПлановыеРемонтныеРаботыСрезПоследних.Отменен = ЛОЖЬ
	|	И торо_ПлановыеРемонтныеРаботыСрезПоследних.Замещен = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ПлановыеРемонтныеРаботы.ДатаНачалаРемонтныхРабот КАК НачалоРемонта,
	|	ВТ_ПлановыеРемонтныеРаботы.ДатаОкончанияРемонтныхРабот КАК ОкончаниеРемонта,
	|	ВТ_ПлановыеРемонтныеРаботы.Регистратор КАК Регистратор,
	|	ВТ_ПлановыеРемонтныеРаботы.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ВТ_ПлановыеРемонтныеРаботы.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ВТ_ПлановыеРемонтныеРаботы.ID КАК ID
	|ИЗ
	|	ВТ_ПлановыеРемонтныеРаботы КАК ВТ_ПлановыеРемонтныеРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ПО ВТ_ПлановыеРемонтныеРаботы.ID = торо_ОбщиеДанныеПоРемонтам.IDРемонта
	|ГДЕ
	|	торо_ОбщиеДанныеПоРемонтам.Завершен = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидРемонтныхРабот,
	|	НачалоРемонта";

	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата());
	Запрос.УстановитьПараметр("МассивОР", ЗаголовокИОсновныеДанные.Ссылка);

	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпПредстоящиеРемонты"), ТабДок);	
		Выборка = Результат.Выбрать();
		ТаблВыполненныеРемонты = Макет.ПолучитьОбласть("ТблПредстоящиеРемонты");

		Пока Выборка.Следующий() Цикл
			ТаблВыполненныеРемонты.Параметры.Заполнить(Выборка);
			ТаблВыполненныеРемонты.Параметры.ВидРемонтныхРабот = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Выборка.ВидРемонтныхРабот);
			ТабДок.Вывести(ТаблВыполненныеРемонты, Выборка.Уровень()); 
		КонецЦикла;
	КонецЕсли;
	#КонецВставки
	//////////////////////////////////////////////////////////////////////////	
	// Область "Наряды на регламентные мероприятия"
	Если ПолучитьФункциональнуюОпцию("торо_ИспользоватьНарядыНаРегламентноеМероприятие") Тогда 
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("НарядыРМ"), ТабДок);

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_МаршрутыРегламентныхМероприятий.СписокОбъектов КАК СписокОбъектов
		|ПОМЕСТИТЬ СписокОбъектовРМ
		|ИЗ
		|	РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
		|ГДЕ
		|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта = &ОбъектРемонта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка КАК Ссылка,
		|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.Дата КАК Дата,
		|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.Номер КАК Номер,
		|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ВидРемонтныхРабот КАК ВидМероприятия,
		|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ДатаНачала КАК ДатаНачала,
		|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.торо_НарядНаРегламентноеМероприятие.РегламентныеМероприятия КАК торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия
		|ГДЕ
		|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.ОбъектРемонта В
		|			(ВЫБРАТЬ
		|				СписокОбъектовРМ.СписокОбъектов КАК СписокОбъектов
		|			ИЗ
		|				СписокОбъектовРМ КАК СписокОбъектовРМ)
		|	И торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	торо_НарядНаРегламентноеМероприятиеРегламентныеМероприятия.Ссылка.Дата";

		Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
		Результат = Запрос.Выполнить();

		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпНарядыРМ"), Табдок);
			Область = Макет.ПолучитьОбласть("ТблНарядыРМ");

			Пока Выборка.Следующий() Цикл
				ЗаполнитьИВывестиОбласть(Область, Табдок, Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	//////////////////////////////////////////////////////////////////////////	
	// Область "Выполненные регламентные мероприятия"
	ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ВыполненныеРМ"), ТабДок);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_МаршрутыРегламентныхМероприятий.СписокОбъектов КАК СписокОбъектов
	|ПОМЕСТИТЬ СписокОбъектовРМ
	|ИЗ
	|	РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|ГДЕ
	|	торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта = &ОбъектРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СписокОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗавершенныеМероприятия.ВидМероприятия КАК ВидМероприятия,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыНачала.ДатаНачала, торо_ЗавершенныеМероприятия.ДатаОкончания) КАК ПланДатаНачалаРемонтныхРабот,
	|	ЕСТЬNULL(торо_АктуальныеПлановыеДатыНачала.ДатаОкончания, торо_ЗавершенныеМероприятия.ДатаОкончания) КАК ПланДатаЗавершенияРемонтныхРабот,
	|	ЕСТЬNULL(торо_СвернутыеФактическиеДатыРемонтов.ДатаНачала, торо_ЗавершенныеМероприятия.ДатаОкончания) КАК ФактДатаНачалаРемонтныхРабот,
	|	ЕСТЬNULL(торо_СвернутыеФактическиеДатыРемонтов.ДатаОкончания, торо_ЗавершенныеМероприятия.ДатаОкончания) КАК ФактДатаЗавершенияРемонтныхРабот,
	|	торо_ЗавершенныеМероприятия.Регистратор КАК Документ
	|ИЗ
	|	РегистрСведений.торо_ЗавершенныеМероприятия КАК торо_ЗавершенныеМероприятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыНачала
	|		ПО торо_ЗавершенныеМероприятия.ID = торо_АктуальныеПлановыеДатыНачала.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СвернутыеФактическиеДатыРемонтов КАК торо_СвернутыеФактическиеДатыРемонтов
	|		ПО торо_ЗавершенныеМероприятия.ID = торо_СвернутыеФактическиеДатыРемонтов.IDРемонта
	|ГДЕ
	|	торо_ЗавершенныеМероприятия.СписокОбъектов В
	|			(ВЫБРАТЬ
	|				СписокОбъектовРМ.СписокОбъектов КАК СписокОбъектов
	|			ИЗ
	|				СписокОбъектовРМ КАК СписокОбъектовРМ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	торо_ЗавершенныеМероприятия.ВидМероприятия,
	|	ПланДатаНачалаРемонтныхРабот";

	Запрос.УстановитьПараметр("ОбъектРемонта", ЗаголовокИОсновныеДанные.Ссылка);
	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		ЗаполнитьИВывестиОбласть(Макет.ПолучитьОбласть("ТблШпВыполненныеРМ"),ТабДок);
		Выборка = Результат.Выбрать();
		Область = Макет.ПолучитьОбласть("ТблВыполненныеРМ");

		Пока Выборка.Следующий() Цикл
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.ВидМероприятия = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(Выборка.ВидМероприятия);
			ТабДок.Вывести(Область, Выборка.Уровень()); 
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры
